In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt
import  seaborn as sns

In [2]:
df=pd.read_csv("advanced_eda_practice_dataset.csv")

In [3]:
df.head()

,Employee_ID,Age,Gender,Department,Education_Level,Experience_Years,Salary,Performance_Score,Work_Hours_Per_Week,Remote_Work,Job_Satisfaction,Promotion_Last_2_Years,Attrition,Joining_Date
0,1001,49,Female,IT,Master,18,116188.0,2.82,47,Yes,4.73,No,Yes,2015-01-31
1,1002,35,Male,Finance,Master,10,34748.0,2.62,40,No,3.26,Yes,No,2015-02-28
2,1003,28,Female,Marketing,PhD,4,116769.0,NaN,39,No,3.79,No,Yes,2015-03-31
3,1004,41,Female,IT,PhD,11,39435.0,4.27,59,No,4.69,No,Yes,2015-04-30
4,1005,39,Male,IT,PhD,2,33709.0,2.14,35,Yes,NaN,No,No,2015-05-31

In [4]:
df.tail()

,Employee_ID,Age,Gender,Department,Education_Level,Experience_Years,Salary,Performance_Score,Work_Hours_Per_Week,Remote_Work,Job_Satisfaction,Promotion_Last_2_Years,Attrition,Joining_Date
118,1119,40,Male,Marketing,Bachelor,6,64816.0,3.82,47,No,3.21,No,Yes,2024-11-30
119,1120,50,Female,IT,Bachelor,2,75106.0,2.73,44,Yes,2.74,Yes,Yes,2024-12-31
120,1006,43,Female,HR,Master,0,60355.0,2.81,55,No,1.61,No,Yes,2015-06-30
121,1007,31,Male,HR,Master,0,85771.0,2.07,56,No,3.31,No,Yes,2015-07-31
122,1008,31,Male,Finance,PhD,7,87799.0,3.49,55,No,3.43,Yes,Yes,2015-08-31

In [5]:
df.isnull().sum()

Employee_ID               0
Age                       0
Gender                    0
Department                0
Education_Level           0
Experience_Years          0
Salary                    5
Performance_Score         5
Work_Hours_Per_Week       0
Remote_Work               0
Job_Satisfaction          5
Promotion_Last_2_Years    0
Attrition                 0
Joining_Date              0
dtype: int64

In [6]:
df['Salary']=df['Salary'].fillna(df['Salary'].median())

In [7]:
df['Performance_Score']=df['Performance_Score'].fillna(df['Performance_Score'].median())

In [8]:
df.isnull().sum()

Employee_ID               0
Age                       0
Gender                    0
Department                0
Education_Level           0
Experience_Years          0
Salary                    0
Performance_Score         0
Work_Hours_Per_Week       0
Remote_Work               0
Job_Satisfaction          5
Promotion_Last_2_Years    0
Attrition                 0
Joining_Date              0
dtype: int64

In [9]:
df['Job_Satisfaction']=df['Job_Satisfaction'].fillna(df['Job_Satisfaction'].median())

In [10]:
df.isnull().sum()

Employee_ID               0
Age                       0
Gender                    0
Department                0
Education_Level           0
Experience_Years          0
Salary                    0
Performance_Score         0
Work_Hours_Per_Week       0
Remote_Work               0
Job_Satisfaction          0
Promotion_Last_2_Years    0
Attrition                 0
Joining_Date              0
dtype: int64